In [2]:
# Import the liabraries

import pandas as pd
import warnings
warnings.filterwarnings("ignore")

 - **Read the three files into python as dataframes**

In [3]:
df1 = pd.read_csv("file1.csv")
df2 = pd.read_csv("file2.csv")
df3 = pd.read_csv("file3.csv")

In [4]:
df1.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [5]:
df2.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

In [6]:
df3.head(2)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car

 - **Show the DataFrame's shape**

In [7]:
df1.shape

(4008, 11)

In [8]:
df2.shape

(996, 11)

In [9]:
df3.shape

(7070, 11)

 - **Standardize header names**

In [10]:
df1.columns = [df1.columns[i].lower().replace(' ', '_') for i in range(len(df1.columns))]
df1.columns

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [11]:
df1 = df1.rename(columns={'st':'state'})
df1.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [12]:
df1.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [13]:
df2.columns = [df2.columns[i].lower().replace(' ', '_') for i in range(len(df2.columns))]
df2.columns

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [14]:
df2 = df2.rename(columns={'st':'state'})
df2.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [15]:
df2.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

In [16]:
df3.columns = [df3.columns[i].lower().replace(' ', '_') for i in range(len(df3.columns))]
df3.columns

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [17]:
df3.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

 - **Rearrange the columns in the dataframe as needed**

In [18]:
df1 = df1[['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class']]

In [19]:
df1.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,2.704934,Personal Auto,Four-Door Car

In [20]:
df3 = df3[['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class']]

In [21]:
df3.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,499.2,Personal Auto,Two-Door Car

In [22]:
df3.shape

(7070, 11)

 - **Concatenate the three dataframes**

In [23]:
concat_df = pd.concat([df1, df2, df3])

In [24]:
concat_df.shape

(12074, 11)

In [25]:
concat_df.tail(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
7067,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,790.784983,Corporate Auto,Four-Door Car
7068,UP19263,California,M,College,7524.442436,21941.0,96.0,0,691.200000,Personal Auto,Four-Door Car
7069,Y167826,California,M,College,2611.836866,0.0,77.0,0,369.600000,Corporate Auto,Two-Door Car

 - **Which columns are numerical?**

In [27]:
import numpy as np

data_numerics_only = concat_df.select_dtypes(include=np.number)
data_numerics_only

       income  monthly_premium_auto  total_claim_amount
0         0.0                1000.0            2.704934
1         0.0                  94.0         1131.464935
2     48767.0                 108.0          566.472247
3         0.0                 106.0          529.881344
4     36357.0                  68.0           17.269323
...       ...                   ...                 ...
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7067      0.0                  85.0          790.784983
7068  21941.0                  96.0          691.200000
7069      0.0                  77.0          369.600000

[12074 rows x 3 columns]

**columns 'income','monthly_premium_auto' and 'total_claim_amount' are of numerical type.**

 - **Which columns are categorical?**

In [26]:
data_objects_only = concat_df.select_dtypes(include = np.object)
data_objects_only

,customer,state,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,1/0/00,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,697953.59%,1/0/00,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1288743.17%,1/0/00,Personal Auto,Two-Door Car
3,WW63253,California,M,Bachelor,764586.18%,1/0/00,Corporate Auto,SUV
4,GA49547,Washington,M,High School or Below,536307.65%,1/0/00,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23405.98798,0,Personal Auto,Four-Door Car
7066,PK87824,California,F,College,3096.511217,0,Corporate Auto,Four-Door Car
7067,TD14365,California,M,Bachelor,8163.890428,3,Corporate Auto,Four-Door Car
7068,UP19263,California,M,College,7524.442436,0,Personal Auto,Four-Door Car
7069,Y167826,California,M,College,2611.836866,0,Corporate Auto,Two-Door Car

**columns 'customer','state','gender','education','customer_lifetime_value','number_of_open_complaints','policy_type' and 'vehicle_class' are of categorical type.**

### Perform the data cleaning operations mentioned so far in class

- **Delete the column education and the number of open complaints from the dataframe.**

In [27]:
data = concat_df.drop(['education','number_of_open_complaints'], axis=1)
data.head(2)

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,policy_type,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,1131.464935,Personal Auto,Four-Door Car

 - **Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.**

In [28]:
# First need to check for null values of data['customer_lifetime_value'] column.
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 9137 non-null   object
 1   state                    9137 non-null   object
 2   gender                   9015 non-null   object
 3   customer_lifetime_value  9130 non-null   object
 4   income                   9137 non-null   float64
 5   monthly_premium_auto     9137 non-null   float64
 6   total_claim_amount       9137 non-null   float64
 7   policy_type              9137 non-null   object
 8   vehicle_class            9137 non-null   object
dtypes: float64(3), object(6)
memory usage: 943.3+ KB

In [29]:
data['customer_lifetime_value']

0               NaN
1        697953.59%
2       1288743.17%
3        764586.18%
4        536307.65%
           ...
7065    23405.98798
7066    3096.511217
7067    8163.890428
7068    7524.442436
7069    2611.836866
Name: customer_lifetime_value, Length: 12074, dtype: object

In [30]:
# Replacing a null values with 0
data['customer_lifetime_value'] = data['customer_lifetime_value'].replace(np.nan,0)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 9137 non-null   object
 1   state                    9137 non-null   object
 2   gender                   9015 non-null   object
 3   customer_lifetime_value  12074 non-null  object
 4   income                   9137 non-null   float64
 5   monthly_premium_auto     9137 non-null   float64
 6   total_claim_amount       9137 non-null   float64
 7   policy_type              9137 non-null   object
 8   vehicle_class            9137 non-null   object
dtypes: float64(3), object(6)
memory usage: 943.3+ KB

In [31]:
data['customer_lifetime_value']

0                 0
1        697953.59%
2       1288743.17%
3        764586.18%
4        536307.65%
           ...
7065    23405.98798
7066    3096.511217
7067    8163.890428
7068    7524.442436
7069    2611.836866
Name: customer_lifetime_value, Length: 12074, dtype: object

In [32]:
# Converting a type of column to string
data['customer_lifetime_value'] = data['customer_lifetime_value'].astype(str)

In [33]:
data['customer_lifetime_value']

0                 0
1        697953.59%
2       1288743.17%
3        764586.18%
4        536307.65%
           ...
7065    23405.98798
7066    3096.511217
7067    8163.890428
7068    7524.442436
7069    2611.836866
Name: customer_lifetime_value, Length: 12074, dtype: object

**A RegEx, or Regular Expression, is a sequence of characters that forms a search pattern. RegEx can be used to check if a string contains the specified search pattern.**

**Syntax**
df-name['col-name'] = df-name['col-name'].str.replace(r'OLD-string/character-to-be-replace$','NEW-string/character-to-be-replace-with')

**Example**
df['filename'] = df['filename'].str.replace(r'.txt$', '')

In [35]:
data1 = data[data['customer_lifetime_value'].str.contains("%")]
data1.head()

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,policy_type,vehicle_class
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,1131.464935,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,566.472247,Personal Auto,Two-Door Car
3,WW63253,California,M,764586.18%,0.0,106.0,529.881344,Corporate Auto,SUV
4,GA49547,Washington,M,536307.65%,36357.0,68.0,17.269323,Personal Auto,Four-Door Car
5,OC83172,Oregon,F,825629.78%,62902.0,69.0,159.383042,Personal Auto,Two-Door Car

In [37]:
data1.shape

(2060, 9)

In [38]:
data1["customer_lifetime_value"] = data1["customer_lifetime_value"].str.replace(r'%$','')
data1["customer_lifetime_value"]

1       697953.59
2      1288743.17
3       764586.18
4       536307.65
5       825629.78
          ...
991     847141.75
992     543121.91
993     568964.41
994     368672.38
995     399258.39
Name: customer_lifetime_value, Length: 2060, dtype: object

In [39]:
data1['customer_lifetime_value'] = data1['customer_lifetime_value'].astype(float)

In [40]:
data1['customer_lifetime_value'] = data1['customer_lifetime_value'].apply(lambda x: x*100)

In [41]:
data1.head()

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,policy_type,vehicle_class
1,QZ44356,Arizona,F,69795359.0,0.0,94.0,1131.464935,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,128874317.0,48767.0,108.0,566.472247,Personal Auto,Two-Door Car
3,WW63253,California,M,76458618.0,0.0,106.0,529.881344,Corporate Auto,SUV
4,GA49547,Washington,M,53630765.0,36357.0,68.0,17.269323,Personal Auto,Four-Door Car
5,OC83172,Oregon,F,82562978.0,62902.0,69.0,159.383042,Personal Auto,Two-Door Car

 - **Check for duplicate rows in the data and remove if any.**

In [43]:
data.duplicated().sum()

2939

In [44]:
#Removing duplicate rows

data = data.drop_duplicates(keep=False)

In [45]:
data.duplicated().sum()

0

**Filter out the data for customers who have an income of 0 or less.**

In [63]:
data = data['income'].astype(int)

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,policy_type,vehicle_class
0,RB50392,Washington,NaN,0,0,1000.0,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,697953.59%,0,94.0,1131.464935,Personal Auto,Four-Door Car
3,WW63253,California,M,764586.18%,0,106.0,529.881344,Corporate Auto,SUV
7,CF85061,Arizona,M,721610.03%,0,101.0,363.029680,Corporate Auto,Four-Door Car
10,SX51350,California,M,473899.20%,0,67.0,482.400000,Personal Auto,Four-Door Car